Revit 2027 API
FabricationPart.TopOfPartElevation Property
 The associated elevation to the top of fabrication part off of the current level.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double TopOfPartElevation { get; }
Public ReadOnly Property TopOfPartElevation As Double
	Get
public:
property double TopOfPartElevation {
	double get ();
}
member TopOfPartElevation : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace